In [1]:
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
sns.set(style="whitegrid")

In [6]:
producer_df = pd.read_csv("../data/producer-prices_aut.csv")
consumer_df = pd.read_csv("../data/consumer-price-indices_aut.csv")

(            Iso3    StartDate     EndDate  Area Code Area Code (M49)  \
 0  #country+code  #date+start   #date+end        NaN             NaN
 1            AUT   1991-01-01  1991-12-31       11.0            '040
 2            AUT   1992-01-01  1992-12-31       11.0            '040
 3            AUT   1993-01-01  1993-12-31       11.0            '040
 4            AUT   1994-01-01  1994-12-31       11.0            '040

             Area        Item Code Item Code (CPC)             Item  \
 0  #country+name  #indicator+code             NaN  #indicator+name
 1        Austria              515          '01341           Apples
 2        Austria              515          '01341           Apples
 3        Austria              515          '01341           Apples
 4        Austria              515          '01341           Apples

    Element Code                     Element  Year Code        Year  \
 0           NaN                         NaN        NaN  #date+year
 1        5530.0  Producer Price (LCU/tonne)     1991.0        1991
 2        5530.0  Producer Price (LCU/tonne)     1992.0        1992
 3        5530.0  Producer Price (LCU/tonne)     1993.0        1993
 4        5530.0  Producer Price (LCU/tonne)     1994.0        1994

    Months Code        Months             Unit                 Value Flag
 0          NaN           NaN  #indicator+type  #indicator+value+num  NaN
 1       7021.0  Annual value              LCU           9620.000000    A
 2       7021.0  Annual value              LCU           8410.000000    A
 3       7021.0  Annual value              LCU           6560.000000    A
 4       7021.0  Annual value              LCU           5460.000000    A  ,
             Iso3    StartDate     EndDate  Area Code Area Code (M49)  \
 0  #country+code  #date+start   #date+end        NaN             NaN
 1            AUT   2000-01-01  2000-01-31       11.0            '040
 2            AUT   2001-01-01  2001-01-31       11.0            '040
 3            AUT   2002-01-01  2002-01-31       11.0            '040
 4            AUT   2003-01-01  2003-01-31       11.0            '040

             Area        Item Code                                        Item  \
 0  #country+name  #indicator+code                             #indicator+name
 1        Austria            23013  Consumer Prices, Food Indices (2015 = 100)
 2        Austria            23013  Consumer Prices, Food Indices (2015 = 100)
 3        Austria            23013  Consumer Prices, Food Indices (2015 = 100)
 4        Austria            23013  Consumer Prices, Food Indices (2015 = 100)

    Element Code Element  Months Code   Months  Year Code        Year  \
 0           NaN     NaN          NaN      NaN        NaN  #date+year
 1        6125.0   Value       7001.0  January     2000.0        2000
 2        6125.0   Value       7001.0  January     2001.0        2001
 3        6125.0   Value       7001.0  January     2002.0        2002
 4        6125.0   Value       7001.0  January     2003.0        2003

               Unit                 Value Flag               Note
 0  #indicator+type  #indicator+value+num  NaN                NaN
 1              NaN             69.372870    X  base year is 2015
 2              NaN             70.861379    X  base year is 2015
 3              NaN             74.179770    X  base year is 2015
 4              NaN             74.110636    X  base year is 2015  )

In [9]:
producer_df = producer_df[["Year" , "Item","Value"]]
producer_df = producer_df.iloc[1]

   Year    Item        Value
1  1991  Apples  9620.000000
2  1992  Apples  8410.000000
3  1993  Apples  6560.000000
4  1994  Apples  5460.000000
5  1995  Apples  4900.000000

In [11]:
producer_df["Year"] = producer_df["Year"].astype(int)
producer_df["Value"] = producer_df["Value"].astype(float)

In [12]:
producer_df.head()

   Year    Item   Value
1  1991  Apples  9620.0
2  1992  Apples  8410.0
3  1993  Apples  6560.0
4  1994  Apples  5460.0
5  1995  Apples  4900.0

In [27]:
product_counts = producer_df["Item"].value_counts()
suspects = product_counts[product_counts > 300].index.tolist()
suspects

['Poppy seed',
 'Barley',
 'Meat of cattle with the bone, fresh or chilled (biological)',
 'Meat of chickens, fresh or chilled (biological)',
 'Raw milk of cattle',
 'Meat of pig with the bone, fresh or chilled (biological)',
 'Meat of sheep, fresh or chilled (biological)',
 'Maize (corn)',
 'Other oil seeds, n.e.c.',
 'Meat of turkeys, fresh or chilled (biological)']

In [29]:
producer_df = producer_df[~producer_df["Item"].isin(suspects)]
producer_df.head()

   Year    Item   Value
1  1991  Apples  9620.0
2  1992  Apples  8410.0
3  1993  Apples  6560.0
4  1994  Apples  5460.0
5  1995  Apples  4900.0

In [30]:
sorted(producer_df["Item"].dropna(),unique().tolist())

NameError: name 'unique' is not defined